import { FirstYearGameData } from "@learning-game/types/option-select-type";

export const FIRST_YEAR_GAME_DATA: FirstYearGameData[] = [
  {
    level: 0,
    image: "/music-box/guitare.png",
    data: [
      {
        text: ["َبِالْأَصْحَاب _____", "أحِبُّ فِي مَدْرَسَتِي"],
        missing: "اللِّقَاءَ",
        options: ["اللِّقَاءَ", "اللَّهْوَ", "الدِّرَاسَةَ", "الرِّيَاضَةَ"],
      },
      {
        text: ["وَصُحْبَةَ الْكِتَابِ", "وَ_____ فِي سَاحَتِهَا"],
        missing: "اللَّهْوَ",
        options: ["اللَّهْوَ", "الدِّينِ", "اللُّغَةِ", "الرَّقْصِ"],
      },
      {
        text: ["مُرْتَقِبًا بِالْبَابِ", "_____ قِفْ كُلَّ يَوْم"],
        missing: "تَرَنِي",
        options: ["تَرَنِي", "تَحْتَسِي", "تَرْتَبِكُ", "تَمْشِينَ"],
      },
      {
        text: ["بَقِيَّةَ الْأَحْبَابِ", "_____ مُنْتَظِرًا فِي"],
        missing: "لَهْفَةٍ",
        options: ["لَهْفَةٍ", "سَعَادَةٍ", "دَمْعَةٍ", "مُحَارَبَةٍ"],
      },
      {
        text: ["كَالْفَارِسِ الْمُهَابِ", "_____ وَفِي يَدِي "],
        missing: "مِحْفَظَتِي",
        options: ["مِحْفَظَتِي", "الْقَلَادَةِ", "الْهَوَادِ", "الْمِظَلَّةِ"],
      },
      {
        text: ["_____لِلْعِلْمٍ و", "أَسْعَى بِهَا مُنْدَفِعًا"],
        missing: "الْآدَابِ",
        options: [
          "الْآدَابِ",
          "الْجَمَاعَةِ",
          "الْمُدَارِسِ",
          "الْمُسَافَرَةِ",
        ],
      },
      {
        text: ["_____مُرْتَقِبًا ب", "قِفْ كُلَّ يَوْمٍ تَرَنِي"],
        missing: "الْبَابِ",
        options: ["الْبَابِ", "الطَّابِقِ", "الْمَحْرَابِ", "الْفَصْلِ"],
      },
      {
        text: ["_____بَقِيَّةَ ", "مُنْتَظِرًا فِي لَهْفَةٍ"],
        missing: "الْأَحْبَابِ",
        options: [
          "الْأَحْبَابِ",
          "الْأَشْيَاءِ",
          "الْمُدَرِّسِينَ",
          "الْمُحِبِّين",
        ],
      },
    ],
  },
  {
    level: 1,
    image: "/music-box/piano.png",
    data: [
      {
        text: ["ضُمَّنِي _____ قَوِيًّا", "يَا أَبِي حُلْوَ الْمُحَيَّا"],
        missing: "ضَمًّا",
        options: ["ضَمًّا", "قُبْلَةً", "نَظَرَةً", "هَمْسَةً"],
      },
      {
        text: ["يَا أَبِي وَ _____ بُنَيَّا", "ضُمَّنِي مَازِلْتُ طِفْلا"],
        missing: "أَهْمِسْ",
        options: ["أَهْمِسْ", "أُدْنِي", "أُجْلِسُ", "أَحْمِلُ"],
      },
      {
        text: ["تَمْسَحُ _____ الطَّرِيَّا", "أَنْتَ كَفٌ مِنْ عَبِير"],
        missing: "الْجُرْحَ",
        options: ["الْجُرْحَ", "الْهَمَّ", "الْحَسَرَة", "الْغَمَ"],
      },
      {
        text: ["تَغْرِسُ _____ النَّدِيَّا", "أَنْتَ كَفٌ مِنْ عَبِير"],
        missing: "الْوَرْدَ",
        options: ["الْوَرْدَ", "الزَّهْرَ", "النَّجْمَ", "الْبُشْرَى"],
      },
      {
        text: ["لَكَ _____ عَرَبِيًّا", "يَا أَبِي قَد صَغْتُ حُبِي"],
        missing: "لَحْنًا",
        options: ["لَحْنًا", "غَرْبِيًّا", "مَجْنُونًا", "رُومَانِيًّا"],
      },
      {
        text: ["وَ أَهْمِسْ بُنَيَّا _____", "يَا أَبِي حُلْوَ الْمُحَيَّا"],
        missing: "ضُمَّنِي",
        options: ["ضُمَّنِي", "أَحْتَسِي", "أُدْنِي", "أُرَافِقُ"],
      },
    ],
  },
  {
    level: 2,
    image: "/music-box/flut.png",
    data: [
      {
        text: ["_____ مَا أَجْمَلَ", "قَالَتْ لِيَ الْمِرْآهُ"],
        missing: "الْحَيَاة",
        options: ["الْحَيَاة", "الْعُمْر", "الْجَمَال", "الطُّمَأْنِينَة"],
      },
      {
        text: ["_____ وَحُسْنُهَاْ", "جَمَالُهَا نَظَافَهْ"],
        missing: "لَطَافَه",
        options: ["لَطَافَه", "قُدْرَةً", "مُحَبَّةً", "رَحْمَةً"],
      },
      {
        text: ["_____ أَوْصَى بِهَا", "طَهَارَةُ الْهِنْدَامْ"],
        missing: "الْإِسْلَام",
        options: ["الْإِسْلَام", "الْتَّوْبَة", "الصَّلاة", "الزَّكاة"],
      },
      {
        text: ["وَالْقَ _____ بَاسِمَا", "فَكُنْ نَظِيفًا دَائِمَا"],
        missing: "الرِفَاق",
        options: ["الرِفَاق", "الْأَحْبَاب", "الْجَمَاعَة", "الْإِيمَان"],
      },
      {
        text: ["_____ وَالْوَلَدُ", "يُحِبَّكَ الْكَبِيرُ"],
        missing: "الصَّغِيرُ",
        options: ["الصَّغِيرُ", "الْكَبِيرُ", "الرَّجُلُ", "الْفَارِسُ"],
      },
      {
        text: ["_____ مِنْ صِحَّةِ", "نَظَافَةُ الْأَبْدَانِ"],
        missing: "الْإِيمَانِ",
        options: ["الْإِيمَانِ", "الْإِحْسَانِ", "الْتَّوْبَةِ", "الْحِرْصِ"],
      },
    ],
  },
  {
    level: 3,
    image: "/music-box/drum.png",
    data: [
      {
        text: [
          "وَفَصْلُ الشَّتَاءِ مَضَى وَأَرْتَحَلْ",
          "أَطَلَّ _____ الْجَمِيلُ وَحَلْ",
        ],
        missing: "الرَّبِيعُ",
        options: ["الرَّبِيعُ", "الْخَرِيفُ", "الصَّيْفُ", "الْفَصْلُ"],
      },
      {
        text: [
          "عَرُوسٌ _____ بِأَبْهَى الْحُلَلْ",
          "فَهَذِي الطَّبِيعَةُ مِنْ وَشْيِهِ",
        ],
        missing: "تَمِيسُ",
        options: ["تَمِيسُ", "تُزَخِّفُ", "تَتَجَلَّى", "تَغْنِي"],
      },
      {
        text: [
          "بِأَطْيَابِ _____ وَأَنْفَاسِ فُلْ",
          "وَقَدْ عَطَّرَ الزَّهْرُ أَرْجَاءَهَا",
        ],
        missing: "وَرْدٍ",
        options: ["وَرْدٍ", "أَطْيَابٍ", "فُرْسَانٍ", "مَوَارِيدِ"],
      },
      {
        text: [
          "تَرْقُصُ رَقْصَ الْجَذَلْ _____",
          "وَغَنَّتْ عَلَى الدَّوْحِ شَادِيَةً",
        ],
        missing: "عَصَافِيرُ",
        options: ["عَصَافِيرُ", "طُيُورُ", "فِراشَاتُ", "زُهُورُ"],
      },
      {
        text: [
          "وَطَابَ _____ بِهِ وَاعْتَدَلْ",
          "صَفَا الْجَوُّ وَالشَّمْسُ قَدْ أَشْرَقَتْ",
        ],
        missing: "الْهَوَاءُ",
        options: ["الْهَوَاءُ", "الْجَوُّ", "الرَّوْحُ", "السَّحَابُ"],
      },
      {
        text: [
          "وَتَشْفِي الْعِلَل ْ _____",
          "فَهَيَّا إِلَى الْحَقْلِ فِي نُزْهَةٍ تُزِيلُ",
        ],
        missing: "الْعَنَاءَ",
        options: ["الْعَنَاءَ", "الْحَزَنَ", "الْفَجْوَة", "الْبُعدُ"],
      },
    ],
  },
];
