export const LandingPageContent = {
  welcome: "مرحبا بك في مجموعة الألعاب التفاعلية",
  explaining: "يمكنك اختيار لعبة من محموعة الألعاب مخصصة لهدف تعلمي واضح",
  callToAction: "! إبدأ التعلم",
  games: [
    {
      year: 1,
      title: "السفينة",
      level: "السنة الأولى",
      description:
        "لعبة تعتمد على إكمال أبيات محفوظات ناقصة عن طريق اختيار الصور الصحيحة مكان كل كلمة ناقصة، حيث يكون الطفل على متن سفينة تقوم بنقل البضائع إلى وجهاتها وهي مجموعة جزر و في كل جزيرة تتوقف السفينة و ينجز المتعلم المهمة المتمثلة في اكمال كلمات البيوت الناقصة باعتماد الصور اذ يستمع للاجابة و يختار الصورة المناسبة، ولكن يجب عليه إكمال الكلمات الناقصة حتى يتمكن من إيصال الشحنة بنجاح والانتقال من جزيرة الى اخرى.",
      imageUrl: "/landing-page/ship1.jpeg",
      gameUrl: "/ship",
    },
    {
      year: 1,
      title: "صندوق الموسيقى",
      level: "السنة الأولى",
      description:
        "يكتشف الطفل آلة موسيقية مخفية عن طريق إكمال أبيات محفوظات ناقصة، حيث يخرج من الصندوق الموسيقي مجموعة من الكلمات على شكل بطاقات لكل بطاقة لون مختلف والتي يجب على الطفل وضعها في المكان الصحيح.ومع كل بيت ينجزه يظهر جزء من الالة الموسيقية المخفية .",
      imageUrl: "/landing-page/music-box1.jpeg",
      gameUrl: "/music-box",
    },
    {
      year: 2,
      title: "رائد الفضاء",
      level: "السنة لثانية",
      description:
        "تهدف اللعبة إلى إنقاذ رواد الفضاء المسجونين في كواكب مختلفة عبر إكمال أبيات المحفوظات الناقصة. كل قفص يحوي رائد فضاء مقفلاً بقفلين، وعلى اللاعب إيجاد الكلمات الناقصة في البيت الشعري الصحيح لفتح الأقفال وإنقاذ الرواد، إلى أن يتم تحرير جميع رواد الفضاء والعودة بهم إلى الأرض." +
        "تنطلق اللعبة من الفضاء و تتوقف في كل مرة عند كوكب مختلف لخوض مغامرة وانجاز المهمة.",
      imageUrl: "/landing-page/astronaute.png",
      gameUrl: "/astronaute",
    },
    {
      year: 2,
      title: "صندوق الموسيقى",
      level: "السنة لثانية",
      description:
        "في هذه النسخة من اللعبة، يتعين على الطفل تسلق سلم موسيقي للوصول إلى الصندوق الموسيقي عن طريق إكمال الأبيات الناقصة. عند كل مرحلة، يوزع المساعد الذكي بطاقات صوتية غير مكتوبة تحتوي على كلمات، وعلى الطفل الاستماع واختيار الكلمة المناسبة لوضعها في البيت الشعري. كل إجابة صحيحة تسمح له بالصعود درجة في السلم حتى يصل إلى الصندوق الموسيقي في النهاية، حيث يكتشف الآلة الموسيقية المخفية.",
      imageUrl: "/landing-page/music-box2.jpeg",
      gameUrl: "/music-ladder",
    },
  ],
};
