import { SecondYearGameData } from "@learning-game/types/option-select-type";

export const SECOND_YEAR_GAME_DATA: SecondYearGameData[] = [
  {
    level: 0,
    image: "/music-box/guitare.png",
    sound: "/music-box-audio/guitare.mp3",
    title: "العَوْدُ إِلَى المَدْرَسَةِ",
    data: [
      {
        text: [
          "وَعَهْدُ الدَّرْسِ قَدْ حَلَّ",
          "_____ زَمَانُ الصَّيْفِ قَدْ ",
          "نُغَذِي ______ بِالعِلْمِ ",
          "أَلاَ هُبُّوا إِلَى القِسْم",
        ],
        options: [
          {
            missing: "وَلَّى",
            options: ["ذَهَبَ", "وَلَّى", "الجِسْم", "العَقْلَ"],
          },
          {
            missing: "العَقْلَ",
            options: ["ذَهَبَ", "وَلَّى", "الجِسْم", "العَقْلَ"],
          },
        ],
      },
      {
        text: [
          "فَعَادَ الأُنْسُ لِلنَّفْسِ ",
          "______ لَقَدْ عُدْنَا إِلَى  ",
          "كَفَى بِالعِلْمِ هَادِينَا ",
          "فَنُورُ ______ كَالشَّمْسِ ",
        ],
        options: [
          {
            missing: "الدَّرْس",
            options: ["العِلْمِ", "الدَّرْس", "النُّور", "الفَصْل"],
          },
          {
            missing: "العِلْمِ",
            options: ["العِلْمِ", "الدَّرْسِ", "النُّور", "الفَصْل"],
          },
        ],
      },
      {
        text: ["______ إلَى أَغْلَى ", "______ إِلَى العَلْيَاءِ يَا  "],
        options: [
          {
            missing: "تِرْبِي",
            options: ["صَحْبِي", "أَمَانِينَا", "تِرْبِي", "أَحْلاَمِنَا"],
          },
          {
            missing: "أَمَانِينَا",
            options: ["صَحْبِي", "أَمَانِينَا", "تِرْبِي", "أَحْلاَمِنَا"],
          },
        ],
      },
    ],
  },
  {
    level: 1,
    title: "حُلْمُ طِفْلِ",
    image: "/music-box/flut.png",
    sound: "/music-box-audio/flut.mp3",

    data: [
      {
        text: [
          "لِمَاذَا لَمْ يَطُلْ نَوْمِي ؟ ",
          "_____ صَبَاحَ الْخَيْرِ يَا ",
          "_____ وقَصْري شِيدَ ب ",
          "أَنَا قَدْ كُنْتُ سُلْطَانًا ",
        ],
        options: [
          {
            missing: "أُمِّي",
            options: ["أَبِي", "أُمِّي", "النُّورِ", "النَّجْمِ"],
          },
          {
            missing: "النَّجْمِ",
            options: ["أَبِي", "أُمِّي", "النُّورِ", "النَّجْمِ"],
          },
        ],
      },
      {
        text: [
          "لَقَدْ _____ فـي النَّــوْمِ ",
          "كَفَى يَا طِفلُ واُسْتَيْقِظْ ",
          "مَعَ _____ لِلْقِسْمِ ",
          "كَفَى يَا طِفْلُ وَلْتُسْرِعُ ",
        ],
        options: [
          {
            missing: "أَسْرَفْتَ",
            options: ["أَسْرَفْتَ", "أَسْرَعْتَ", "الجِيرَانِ", "الأَتْرَابِ"],
          },
          {
            missing: "الأَتْرَابِ",
            options: ["أَسْرَفْتَ", "أَسْرَعْتَ", "الجِيرَانِ", "الأَتْرَابِ"],
          },
        ],
      },
      {
        text: [
          "تَفُزْ بِالْمَجْدِ وَالْعِلْمِ ْ",
          "_____ وكُنْ لِلدَّرْسِ ",
          "تُحَقِّقْ صُورَةَ الـْحُلْمِ",
          " دَائِمًا تَنْجَحْ ______",
        ],
        options: [
          {
            missing: "سَبَّاقًا",
            options: ["سَرِيعًا", "سَبَّاقًا", "ثَابِرْ", "اجْتَهِدْ"],
          },
          {
            missing: "ثَابِرْ",
            options: ["سَرِيعًا", "سَبَّاقًا", "ثَابِرْ", "اجْتَهِدْ"],
          },
        ],
      },
    ],
  },
  {
    level: 2,
    image: "/music-box/drum.png",
    sound: "/music-box-audio/drum.mp3",

    title: "الْوَلَدُ النَّظِيف ",
    data: [
      {
        text: [
          " الْأَظْفَارَا _____",
          "يَا مُصْطَفَى قُلْ لِي مَتَى ",
          "أَجْعَلُهَا قِصَارَا ",
          "_____ إِذَا بَدَتْ  ",
        ],
        options: [
          {
            missing: "تُقَلِّمْ",
            options: ["تُنَظِّفُ", "طَوِيلَةً", "تُقَلِّمْ", "كَبِيرَةً"],
          },
          {
            missing: "طَوِيلَةً",
            options: ["تُنَظِّفُ", "طَوِيلَةً", "تُقَلِّمْ", "كَبِيرَةً"],
          },
        ],
      },
      {
        text: [
          "مِثْلَ يَدِي مِرَارَا ",
          "_____ أَنَا مُنَظَفً",
          "أُتَمِّمُ الْإِفْطَارَا ",
          "مِنْ قَبْلُ ثُمَّ عِنْدَمَا ",
          "لا يَقْبَلُ انْتِظَارَا ",
          "و_____ رَأْسِي وَقْتَهُ ",
        ],
        options: [
          {
            missing: "فَمِي",
            options: ["أَنْفِي", "حَلْقُ", "فَمِي", "مَشْطُ"],
          },
          {
            missing: "حَلْقُ",
            options: ["أَنْفِي", "حَلْقُ", "فَمِي", "مَشْطُ"],
          },
        ],
      },
      {
        text: [
          "فِي الْمَوْعِدِ الْكِبَارَا ",
          "وَ_____ حَاكِيًا ",
          " اُعْـتِـبـَارَا ______",
          "الْجِسْمُ والثَّوْبُ مَعًا ",
        ],
        options: [
          {
            missing: "أَسْتَحِمُّ",
            options: [
              "أُعِيرُهُمَا",
              "أَغْتَسِلُ",
              "أَسْتَحِمُّ",
              "أُولِيهُمَا",
            ],
          },
          {
            missing: "أُولِيهُمَا",
            options: [
              "أُعِيرُهُمَا",
              "أَغْتَسِلُ",
              "أَسْتَحِمُّ",
              "أُولِيهُمَا",
            ],
          },
        ],
      },
    ],
  },
  {
    level: 3,
    image: "/music-box/piano.png",
    sound: "/music-box-audio/piano.mp3",

    title: "تَلْفَازٌ وَ حَاسُوبٌ",
    data: [
      {
        text: [
          "أَسْرَارَ مَا هَبَّ وَدَبْ ",
          "_____ تِلْفَازُنَا يَحْوِيْ",
          "أَهْدَى لَنَا فَيْضَ الطَّرَبْ ",
          "_____ إِنْ شَاقَنَا عَذَبُ  ",
        ],
        options: [
          {
            missing: "العَجَبْ",
            options: ["الغِنَاءْ", "الكَثِيرْ", "العَجَبْ", "اللَّعِبِ"],
          },
          {
            missing: "الغِنَاءْ",
            options: ["الغِنَاءْ", "الكَثِيرْ", "العَجَبْ", "اللَّعِبِ"],
          },
        ],
      },
      {
        text: [
          "مَا أُمْلِي حَاسُوبِي كَتَبْ ",
          "طَوْعُ _____ سَاحِرِي ",
          "نَصّا _____ مِنْ ذَهَبْ ",
          "انْ رُمْتُ شَرْحًا سَاقَهُ ",
        ],
        options: [
          {
            missing: "البَنَانِ",
            options: ["الكَلاَمِ", "بِلَفْظٍ", "البَنَانِ", "بِحِبْرٍ"],
          },
          {
            missing: "بِلَفْظٍ",
            options: ["الكَلاَمِ", "بِلَفْظٍ", "البَنَانِ", "بِحِبْرٍ"],
          },
        ],
      },
      {
        text: [
          "مَرْحَى لِمَنْ مِنَّا غَلَبْ ",
          "نَلْهُو سَوِيًّا سَاعَةًِ",
          "____ بِالْبَيْتِ فِي أَرْقَى  ",
          "أَعْجُوبَةَ الْعِلْمِ غَدَا ",
          "تَنْظِيمُهَا أَمْرٌ وَجَبْ ",
          "و______ مِنْ حَقِنَا ",
        ],
        options: [
          {
            missing: "الرُّتَبْ",
            options: ["المُتْعَةُ", "المَلَلْ", "الأَمَاكِنْ", "الرُّتَبْ"],
          },
          {
            missing: "المُتْعَةُ",
            options: ["المُتْعَةُ", "المَلَلْ", "الأَمَاكِنْ", "الرُّتَبْ"],
          },
        ],
      },
    ],
  },
  {
    level: 4,
    image: "/music-box/drum.png",
    sound: "/music-box-audio/drum.mp3",

    title: "هَكَذَا نَبْنِي الوَطَنْ",
    data: [
      {
        text: [
          " كُلُّ طِفْلٍ _____؟",
          "مَا رَأْيُكُمْ لَوْ تَبَنَّى",
          " قَرْيَةً ______ مُزْهِرَةً؟",
          "مَا رَأْيُكُمْ لَوْ أَقَمْنَا ",
        ],
        options: [
          {
            missing: "شَجَرَةَ",
            options: ["شَجَرَةَ", "يَانِعَةً", "ذَابِلَةً", "لُعْبَةً"],
          },
          {
            missing: "يَانِعَةً",
            options: ["شَجَرَةَ", "يَانِعَةً", "ذَابِلَةً", "لُعْبَةً"],
          },
        ],
      },
      {
        text: [
          "لَوْ صَحَا فِينَا الضَّمِيرْ",
          "_____ إِنَّهُ أَمْرٌ ",
          "وَأَيَادِينَا الْكَرِيمَهْ ",
          "_____ بِالْإِرَادَةِ وْ  ",
          " اِخْضِرَارًا ",
          "نَقْلِبُ الْجَدْبَ",
        ],
        options: [
          {
            missing: "يَسِيرْ",
            options: ["صَعْب", "العَزِيمَة", "يَسِيرْ", "الكَسَلْ"],
          },
          {
            missing: "العَزِيمَة",
            options: ["صَعْب", "العَزِيمَة", "يَسِيرْ", "الكَسَلْ"],
          },
        ],
      },
      {
        text: [
          "نطْرِدُ عَنَّا الْكَسَلْ ",
          "_____ هَيَّا نَمْضِي فِي ",
          "إِنَّهُ رَمْزُ الْأَمَلْ ",
          "فَلْنُبَادِرْ بِالْعَمَلْ ",
          "  الْوَطَن",
          "______  هَكَذَا ",
        ],
        options: [
          {
            missing: "عَجَلْ",
            options: ["بُطْئ", "عَجَلْ", "نَبْنِي", "نَصْنَعُ"],
          },
          {
            missing: "نَبْنِي",
            options: ["بُطْئ", "عَجَلْ", "نَبْنِي", "نَصْنَعُ"],
          },
        ],
      },
    ],
  },
  {
    level: 5,
    image: "/music-box/flut.png",
    sound: "/music-box-audio/flut.mp3",

    title: "شرَفُ الْعَمَلِ",
    data: [
      {
        text: [
          "وَالْذُلُ فِي عَيْشِ الْكَسَلْ ",
          "_____ الْعِزُّ فِي عَيْشِ  ",
          "رَغْمَ اِجْتِهَادِي لَا أَمَلْ ",
          "_____ إِنِّي فَتًى ذُو  ",
        ],
        options: [
          {
            missing: "العَمَلْ",
            options: ["خَوْفٍ", "العَمَلْ", "هِمَّةٍ", "التَّقَاعُس"],
          },
          {
            missing: "هِمَّةٍ",
            options: ["خَوْفٍ", "العَمَلْ", "هِمَّةٍ", "التَّقَاعُس"],
          },
        ],
      },
      {
        text: [
          "كُلٌّ بِهِ أَجْدَى عَمَــــــــــلْ ْ",
          "_____ فِكْرٌ أَخِي أَوْ  ",
          "كَسْبٌ كَثِيـرٌ لَا يَقِلْ ",
          "_____ لي فِي تَعَاطِي ",
        ],
        options: [
          {
            missing: "سَاعِدٌ",
            options: ["لُعْبَتِي", "حِرْفَتِي", "سَاعِدٌ", "قَوْلٌ"],
          },
          {
            missing: "حِرْفَتِي",
            options: ["لُعْبَتِي", "حِرْفَتِي", "سَاعِدٌ", "قَوْلٌ"],
          },
        ],
      },
      {
        text: [
          "جَاءَتْ بِتَحْقِيقِ الْأَمَلْ ",
          "_____ وَالْأَرْضُ أَغْلَى ",
          "بِعَزْمٍ يَكْتَمِلْ _____",
          "هَيَّا بِنَا نَرْفَعْ مَعـًــــا ",
        ],
        options: [
          {
            missing: "ثَرْوَةٍ",
            options: ["ثَرْوَةٍ", "ثَمَنٍ", "فَشَلًا", "مَجْدًا"],
          },
          {
            missing: "مَجْدًا",
            options: ["ثَرْوَةٍ", "ثَمَنٍ", "فَشَلًا", "مَجْدًا"],
          },
        ],
      },
    ],
  },
  {
    level: 6,
    image: "/music-box/guitare.png",
    sound: "/music-box-audio/guitare.mp3",

    title: "نشيد السلامِ",
    data: [
      {
        text: [
          " ",
          "إِلَى _____ أَدْعُو جَمِيعَ الْبَشَرْ ",
          "",
          "لأحْيَا سَعِيدًا ... كَرِيــــــمًا وَحُرْ ",
          "",
          "أُحِبُّ السَّلَامَ ______ وَعَادَهْ ",
        ],
        options: [
          {
            missing: "السِّلْمِ",
            options: ["شِعَارًا", "الشِّجَارِ", "قَوْلًا", "السِّلْمِ"],
          },
          {
            missing: "شِعَارًا",
            options: ["شِعَارًا", "الشِّجَارِ", "قَوْلًا", "السِّلْمِ"],
          },
        ],
      },
      {
        text: [
          "",
          "وَنُورًا _____ طَرِيقَ السَّعَادهْ ",
          "",
          "وَأَحْلامَ طِفْلِ يحبُّ بِلادَهْ ",
          "",
          "إلَى السّلْمِ أَدْعُو ____ وَقَادَهْ ",
        ],
        options: [
          {
            missing: "يُضِيءُ",
            options: ["تَلاَمِيذًا", "شُعُوبًا", "يُضِيءُ", "يُغْلِقُ"],
          },
          {
            missing: "شُعُوبًا",
            options: ["تَلاَمِيذًا", "شُعُوبًا", "يُضِيءُ", "يُغْلِقُ"],
          },
        ],
      },
      {
        text: [
          "",
          "تَظَلُّ الْمَحَبَّةُ مِـــلْءَ الْعُيُونْ ",
          "",
          "وَمِلْءَ الْقُلُـوبِ ____ حَصِينْ ",
          "",
          "وَجِسْرًا نَـــــمُرُ عَلَيْهِ مَتِينْ ",
          "",
          "___ فَحَيُّوا عَلَـى السِّلْمِ فِي كُلِّ  ",
        ],
        options: [
          {
            missing: "كِتَابًا",
            options: ["كَلاَمًا", "كِتَابًا", "مَكَانْ", "حِينْ"],
          },
          {
            missing: "حِينْ",
            options: ["كَلاَمًا", "كِتَابًا", "مَكَانْ", "حِينْ"],
          },
        ],
      },
    ],
  },
  {
    level: 7,
    image: "/music-box/piano.png",
    sound: "/music-box-audio/piano.mp3",

    title: "دَرْسٌ مُفِيدٌِ",
    data: [
      {
        text: [
          " شَيْءٌ مُثِيرْ _____",
          "...بَيْنَمَا كُنْتُ أَسِيرُ ",
          "حَقًّا أَثَارَتْ دَهْشَتِي ",
          "رَأَيْتُ نَمْلَةٌ تَدُورْ ",
          "مِنْ غَيْرِ _____ أَوْ مَلَلْ ",
          "دَوْمًا تَجِدُّ فِي الْعَمَلْ ",
        ],
        options: [
          {
            missing: "أَذْهَلَنِي",
            options: ["يَأْسٍ", "أَذْهَلَنِي", "نَشَاطٍ", "أَعْجَبَنِي"],
          },
          {
            missing: "يَأْسٍ",
            options: ["يَأْسٍ", "أَذْهَلَنِي", "نَشَاطٍ", "أَعْجَبَنِي"],
          },
        ],
      },
      {
        text: [
          "بَيْتًا مَتِينَ الصَّنْعَــــةِ ",
          "_____ فَـأَنْشَــــــــأَتْ دُونَ  ",
          "حِـمـْلًا يَفُوقُ حَجْمَهَا ",
          "وَحَــمَلَتْ فِي فَمِهَا ",
          " لِوَقْتِ الشِدَّةِ _____",
          "وَاُدْخَرَتْ فِي بَيْتِهَا ",
        ],
        options: [
          {
            missing: "خَلَلْ",
            options: ["حُبًا", "كَنْزًا", "خَلَلْ", "خَطَأْ"],
          },
          {
            missing: "كَنْزًا",
            options: ["حُبًا", "كَنْزًا", "خَلَلْ", "خَطَأْ"],
          },
        ],
      },
      {
        text: [
          "دَرْسًا ______ فِي الثَّبَاتْ ",
          "قَدْ عَلْمَتْـــنِــي وَالْحَيَاةْ ",
          "وَالْـــعَزْمُ رَمُــزُ الْقُـــوَّةِ ",
          "_____ فَالصَّبْرُ بَابٌ ",
        ],
        options: [
          {
            missing: "مُفِيدًا",
            options: ["لِلْحَيَاةِ", "لِلْنَجَاةِ", "جَمِيلاً", "مُفِيدًا"],
          },
          {
            missing: "لِلْنَجَاةِ",
            options: ["لِلْحَيَاةِ", "لِلْنَجَاةِ", "جَمِيلاً", "مُفِيدًا"],
          },
        ],
      },
    ],
  },
];
