import { SecondYearGameData } from "@learning-game/types/option-select-type";

export const SECOND_YEAR_GAME_DATA: SecondYearGameData[] = [
  {
    level: 0,
    image: "/music-box/guitare.png",
    data: [
      {
        text: [" _____ وَعَهْدُ الدَّرْسِ قَد", " _____ زَمَانُ الصَّيْفِ قَد"],
        options: [
          {
            missing: "وَلّى",
            options: ["اِنْتَهَى", "اِقْتَرَبَ", "جَاءَ", "وَلّى"],
          },
          {
            missing: "حَلَّ",
            options: ["اِقتَرَبَ", "بَدَأَ", "مَضَى", "حَلَّ"],
          },
        ],
      },
      {
        text: ["العَقْلَ بِالعِلْم ِ_____", "أَلاَ _____ إِلَى القِسْمِ"],
        options: [
          {
            missing: "هُبُّوا",
            options: ["اِذهَبُوا", "قُومُوا", "هُبُّوا", "اِجلِسُوا"],
          },
          {
            missing: "نُغَذِي",
            options: ["نُقَوِّي", "نُغَذِي", "نَمْلَأُ", "نُرَبِّي"],
          },
        ],
      },
      {
        text: ["ف_____ الأُنْسُ لِلنَّفْسِ", "لَقَدْ _____ إِلَى الدَّرْسِ"],
        options: [
          {
            missing: "عُدْنَا",
            options: ["جِئْنَا", "عُدْنَا", "تَرَكْنَا", "بَدَأنَا"],
          },
          {
            missing: "عَادَ",
            options: ["ذَهَبَ", "بَقِيَ", "عَادَ", "غَادَرَ"],
          },
        ],
      },
      {
        text: ["_____ كَفَى بِالعِلْم", "ف_____ العِلْمِ كَالشَّمْسِ"],
        options: [
          {
            missing: "نُورُ",
            options: ["ضِيَاءُ", "نُورُ", "مَصْبَاحُ", "إِشْرَاقُ"],
          },
          {
            missing: "هَادِينَا",
            options: ["نَاصِحَنَا", "دَلِيلَنَا", "هَادِينَا", "حَافِظِنَا"],
          },
        ],
      },
      {
        text: ["_____ إلَى أَغْلَى", "إِلَى _____ يَا تِرْبِي"],
        options: [
          {
            missing: "العَلْيَاءِ",
            options: ["القِمَّةِ", "العُلُوِّ", "العَلْيَاءِ", "السُّمُوِّ"],
          },
          {
            missing: "أَمَانِينَا",
            options: [
              "أَحْلاَمِنَا",
              "أَمَانِينَا",
              "مَطَالِبِنَا",
              "أُمنِيَاتِنَا",
            ],
          },
        ],
      },
    ],
  },
  {
    level: 1,
    image: "/music-box/flut.png",
    data: [
      {
        text: ["لِمَاذَا لَمْ _____ نَوْمِي ؟", "الْخَيْرِ يَا أُمِّي _____"],
        options: [
          {
            missing: "صَبَاحَ",
            options: ["مَسَاءَ", "لَيْلَ", "نَهَارَ", "صَبَاحَ"],
          },
          {
            missing: "يَطُلْ",
            options: ["يَقْصُرْ", "يَطُلْ", "يَكْثُرْ", "يَذْهَبْ"],
          },
        ],
      },
      {
        text: ["وقَصْري _____ بِالنَّجْمِ", "_____ أَنَا قَدْ كُنْتُ"],
        options: [
          {
            missing: "سُلْطَانًا",
            options: ["مَلِكًا", "سَيِّدًا", "سُلْطَانًا", "قَائِدًا"],
          },
          {
            missing: "شِيدَ",
            options: ["بُنِيَ", "رُفِعَ", "زُيِّنَ", "شِيدَ"],
          },
        ],
      },
      {
        text: ["_____كَفَى يَا طِفلُ وْ", "لَقَدْ ______ فـي النَّــوْمِ"],
        options: [
          {
            missing: "أَسْـــرَفــْتَ",
            options: ["أَكْثَرْتَ", "أَسْـــرَفــْتَ", "تَرَكْتَ", "نَسِيتَ"],
          },
          {
            missing: "اُسْتَيْقِظْ",
            options: ["اِنْتَبِهْ", "اِقُمْ", "اُسْتَيْقِظْ", "اِسْهَرْ"],
          },
        ],
      },
      {
        text: ["مَعَ _____ لِلْقِسْمِ", "_____ كَفَى يَا طِفْلُ "],
        options: [
          {
            missing: "وَلْتُسْرِعُ",
            options: [
              "وَلْتُبَادِرْ",
              "وَلْتُسْرِعُ",
              "وَلْتَتَأَنَّ",
              "وَلْتَنْتَظِرْ",
            ],
          },
          {
            missing: "الْأَتْرَابِ",
            options: [
              "الأَصْدِقَاءِ",
              "الأَقْرَانِ",
              "الزُمَلاءِ",
              "الْأَتْرَابِ",
            ],
          },
        ],
      },
      {
        text: ["بِالْمَجْدِ وَالْعِلْمِ _____", " _____ وكُنْ لِلدَّرْسِ "],
        options: [
          {
            missing: "سَبَّــاقــًـــــا",
            options: [
              "مُجْتَهِدًا",
              "سَبَّــاقــًـــــا",
              "سَرِيعًا",
              "مُبَادِرًا",
            ],
          },
          {
            missing: "تَفُزْ",
            options: ["تَحْصُلْ", "تَكْسِبْ", "تَفُزْ", "تُسَابِقْ"],
          },
        ],
      },
      {
        text: ["صُورَةَ الـْحُلْمِ _____", "و_____ دَائِمًا تَنْجَحْ"],
        options: [
          {
            missing: "ثَابِرْ",
            options: ["اجْتَهِدْ", "ثَابِرْ", "تَوَقَّفْ", "حَافِظْ"],
          },
          {
            missing: "تُحَقِّقْ",
            options: ["تَصِلْ", "تُحَقِّقْ", "تُفَكِّرْ", "تَخْلُقْ"],
          },
        ],
      },
    ],
  },
  {
    level: 2,
    image: "/music-box/drum.png",
    data: [
      {
        text: ["الْأَظْفَارَا _____", "_____ يَا مُصْطَفَى قُلْ لِي"],
        options: [
          {
            missing: "مَتَى",
            options: ["كَيْفَ", "أَيْنَ", "لِمَاذَا", "مَتَى"],
          },
          {
            missing: "تُقَلِّمُ",
            options: ["تَقْطَعُ", "تُقَلِّمُ", "تُطَوِّلُ", "تُزَيِّنُ"],
          },
        ],
      },
      {
        text: ["_____ أَجْعَلُهَا", "إِذَا _____ طَويلةً"],
        options: [
          {
            missing: "بَدَتْ",
            options: ["ظَهَرَتْ", "كَانَتْ", "بَدَتْ", "تَغَيَّرَتْ"],
          },
          {
            missing: "قِصَارَا",
            options: ["طَوِيلَةً", "قَصِيرَةً", "قِصَارَا", "مُنْحَنِيَةً"],
          },
        ],
      },
      {
        text: ["_____ مِثْلَ يَدِي", "أَنَا _____ فَمِي"],
        options: [
          {
            missing: "مُنَظَفٌ",
            options: ["مُعَطَّرٌ", "مُنَظَفٌ", "مُغْسَلٌ", "مُكَرَّمٌ"],
          },
          {
            missing: "مِرَارَا",
            options: ["قَلِيلًا", "دَائِمًا", "مِرَارَا", "نَادِرًا"],
          },
        ],
      },
      {
        text: ["الْإِفْطَارَا _____", "ثُمَّ عِنْدَمَا _____"],
        options: [
          {
            missing: "مِنْ قَبْلُ",
            options: [
              "مِنْ بَعْدُ",
              "مِنْ قَبْلُ",
              "فِي النِّهَايَةِ",
              "أَحْيَانًا",
            ],
          },
          {
            missing: "أُتَمِّمُ",
            options: ["أَبْدَأُ", "أُتَمِّمُ", "أَتْرُكُ", "أَسْرِعُ"],
          },
        ],
      },
      {
        text: ["_____ لا يَقْبَلُ", "رَأْسِي وَقْتَهُ _____"],
        options: [
          {
            missing: "وَحَلْقُ",
            options: ["قَصُّ", "وَحَلْقُ", "تَخْفِيفُ", "تَجْمِيلُ"],
          },
          {
            missing: "انْتِظَارَا",
            options: ["تَأْجِيلًا", "تَرَدُّدًا", "انْتِظَارَا", "تَأْخِيرًا"],
          },
        ],
      },
      {
        text: ["فِي _____ الْكِبَارَا", "_____ وَأَسْتَحِم"],
        options: [
          {
            missing: "حَاكِيًا",
            options: ["مُقَلِّدًا", "حَاكِيًا", "مُتَحَدِّثًا", "مُفَكِّرًا"],
          },
          {
            missing: "الْمَوْعِدِ",
            options: ["الزَّمَنِ", "الْمَوْقِفِ", "الْمَوْعِدِ", "الزَّمَانِ"],
          },
        ],
      },
      {
        text: ["اُعْـتِـبـَارَا _____", "_____ الْجِسْمُ والثَّوْبُ"],
        options: [
          {
            missing: "مَعًا",
            options: ["فَرْدًا", "مُتَفَرِّقَيْنِ", "مَعًا", "مُخْتَلِفَيْنِ"],
          },
          {
            missing: "أُولِيـهِمَا",
            options: [
              "أُقَدِّرُهُمَا",
              "أَتْرُكُهُمَا",
              "أُولِيـهِمَا",
              "أَهْمِلُهُمَا",
            ],
          },
        ],
      },
    ],
  },
  {
    level: 3,
    image: "/music-box/piano.png",
    data: [
      {
        text: ["مَا هَبَّ وَدَبْ _____", "تِلْفَازُنَا _____ الْعَجَبْ"],
        options: [
          {
            missing: "يَحْوِي",
            options: ["يَضُمُّ", "يَحْوِي", "يَجْمَعُ", "يَكْتُبُ"],
          },
          {
            missing: "أَسْرَارَ",
            options: ["عَجَائِبَ", "أَسْرَارَ", "خَفَايَا", "أَخْبَارَ"],
          },
        ],
      },
      {
        text: [
          "لَنَا فَيْضَ الطَّرَب ْ _____",
          "إِنْ شَاقَنَا _____ الْعِنَاء",
        ],
        options: [
          {
            missing: "عَذَبُ",
            options: ["حُلْوُ", "عَذَبُ", "مُرُّ", "صَعْبُ"],
          },
          {
            missing: "أَهْدَى",
            options: ["أَعْطَى", "أَهْدَى", "قَدَّمَ", "جَلَبَ"],
          },
        ],
      },
      {
        text: ["مَا _____ حَاسُوبِي كَتَبْ", "_____ طَوْعُ الْبَنَانِ"],
        options: [
          {
            missing: "سَاحِرِي",
            options: ["مُعَلِّمِي", "سَاحِرِي", "دَلِيلِي", "قَائِدِي"],
          },
          {
            missing: "أُمْلِي",
            options: ["أَمْلَأُ", "أُمْلِي", "أَكْتُبُ", "أَقُولُ"],
          },
        ],
      },
      {
        text: ["بِلَفْظِ مِنْ ذَهَبْ _____", "_____ انْ رُمْتُ شَرْحًاُ"],
        options: [
          {
            missing: "سَاقَهُ",
            options: ["أَرْسَلَهُ", "سَاقَهُ", "نَقَلَهُ", "فَهِمَهُ"],
          },
          {
            missing: "نَصّا",
            options: ["كِتَابًا", "حِكَايَةً", "نَصّا", "مَقَالًا"],
          },
        ],
      },
      {
        text: ["لِمَنْ مِنَّا غَلَبْ _____", "سَوِيًّا سَاعَةً _____"],
        options: [
          {
            missing: "نَلْهُو",
            options: ["نَلْعَبُ", "نَلْهُو", "نَسْمَعُ", "نَقْرَأُ"],
          },
          {
            missing: "مَرْحَى",
            options: ["هَنِيئًا", "مَرْحَى", "مُبَارَكٌ", "أَحْسَنْتَ"],
          },
        ],
      },
      {
        text: ["_____ بِالْبَيْتِ فِي أَرْقَىْ", "الْعِلْمِ غَدَا _____"],
        options: [
          {
            missing: "أَعْجُوبَةَ",
            options: ["رَائِعَةَ", "أَعْجُوبَةَ", "مُبْهِرَةَ", "مُفَاجَأَةَ"],
          },
          {
            missing: "الرُّتَبْ",
            options: [
              "الدَّرَجَاتِ",
              "الرُّتَبْ",
              "الْمَرَاتِبِ",
              "المَقَامَاتِ",
            ],
          },
        ],
      },
      {
        text: ["أَمْرٌ وَجَبْ _____", "_____ وَالْمُتْعَةً مِنْ"],
        options: [
          {
            missing: "حَقِنَا",
            options: ["مِلْكِنَا", "حَقِنَا", "نَصِيبُنَا", "وَاجِبُنَا"],
          },
          {
            missing: "تَنْظِيمُهَا",
            options: [
              "إِدَارَتُهَا",
              "تَنْظِيمُهَا",
              "تَحْكِيمُهَا",
              "إِعْدَادُهَا",
            ],
          },
        ],
      },
    ],
  },
];
